---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetCurves
source: html/d499bdaa-b2a6-caea-3ee1-6c9e74d0abbf.htm
---
# Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetCurves Method

Gets the IfcCurve handles created representing the processed geometry and stored in this object.

## Syntax (C#)
```csharp
public IList<IFCAnyHandle> GetCurves()
```

## Returns
The collection of curve handles.